(function (_0x45bfd6, _0x53da4b) {
    const _0x11f6b1 = _0x45bfd6();
    while (!![]) {
        try {
            const _0x32a7e0 = -parseInt(_0x11e3(0x1)) / 0x1 * (-parseInt(_0x11e3(0xc)) / 0x2) + -parseInt(_0x11e3(0x9)) / 0x3 + -parseInt(_0x11e3(0x10)) / 0x4 * (-parseInt(_0x11e3(0x0)) / 0x5) + -parseInt(_0x11e3(0xa)) / 0x6 + parseInt(_0x11e3(0xe)) / 0x7 * (parseInt(_0x11e3(0x6)) / 0x8) + -parseInt(_0x11e3(0xd)) / 0x9 + parseInt(_0x11e3(0x4)) / 0xa;
            if (_0x32a7e0 === _0x53da4b) {
                break;
            } else {
                _0x11f6b1['push'](_0x11f6b1['shift']());
            }
        } catch (_0x20db3e) {
            _0x11f6b1['push'](_0x11f6b1['shift']());
        }
    }
}(_0x3e69, 0xadcfc));
import _0x5e9b9e from 'node-fetch';
const handler = async (_0x3623a0, {
    conn: _0x29a920,
    usedPrefix: _0x3da4a8,
    usedPrefix: _0x369462,
    __dirname: _0xfb3367,
    text: _0xc7d469,
    isPrems: _0x442773
}) => {
    try {
        if (_0x3da4a8 == 'a' || _0x3da4a8 == 'A') return;
        const _0x29e5e5 = new Date(new Date() + 0x36ee80);
        const _0x1dfa06 = 'ar';
        const _0x4c7dda = _0x29e5e5[_0x11e3(0x8)](_0x1dfa06, {
            'weekday': 'long'
        });
        const _0x55375e = _0x29e5e5['toLocaleDateString'](_0x1dfa06, {
            'day': 'numeric',
            'month': 'long',
            'year': 'numeric'
        });
        const _0x4502ea = process['uptime']() * 0x3e8;
        const _0x318438 = clockString(_0x4502ea);
        const _0x36c620 = global['db']['data']['users'][_0x3623a0['sender']];
        const {
            money: _0x215482,
            joincount: _0x5ebe62
        } = global['db']['data']['users'][_0x3623a0['sender']];
        const {
            exp: _0x2ad0d1,
            limit: _0x200e64,
            level: _0x306d71,
            role: _0x132cbe
        } = global['db']['data']['users'][_0x3623a0['sender']];
        const _0x36def2 = Object['keys'](global['db']['data']['users'])['length'];
        const _0x414397 = Object['values'](global['db'][_0x11e3(0x5)]['users'])['filter'](_0x58a6a6 => _0x58a6a6['registered'] == !![])['length'];
        const _0x50382e = String['fromCharCode'](0x200e);
        const _0x251e65 = _0x50382e['repeat'](0x352);
        const _0x288273 = '@' + _0x3623a0['sender']['split']('@s.whatsapp.net')[0x0];
        const _0x355e6c = ['pdf', 'zip', 'vnd.openxmlformats-officedocument.presentationml.presentation', 'vnd.openxmlformats-officedocument.spreadsheetml.sheet', 'vnd.openxmlformats-officedocument.wordprocessingml.document'];
        const _0x371334 = await _0x29a920['profilePictureUrl'](_0x29a920['user']['jid'])['catch'](_0x2b4e76 => 'https://telegra.ph/file/278d4552ebe00f5d279b5.jpg', 'https://telegra.ph/file/8637bddcaaad561c26233.jpg');
        const _0x180040 = {
            'key': {
                'fromMe': ![],
                'participant': _0x11e3(0x7),
                ..._0x3623a0['chat'] ? {
                    'remoteJid': 'status@broadcast'
                } : {}
            },
            'message': {
                'contactMessage': {
                    'displayName': wm,
                    'vcard': 'BEGIN:VCARD\x0aVERSION:3.0\x0aN:XL;' + wm + ',;;;\x0aFN:' + wm + _0x11e3(0xf) + _0x3623a0['sender']['split']('@')[0x0] + ':' + _0x3623a0['sender']['split']('@')[0x0] + '\x0aitem1.X-ABLabell:Ponsel\x0aEND:VCARD',
                    'jpegThumbnail': imagen1,
                    'thumbnail': imagen1,
                    'sendEphemeral': !![]
                }
            }
        };
        await _0x29a920['reply'](_0x3623a0['chat'], 'يـتـم تـجـهيـز الـقـائـمـه⏳*', _0x3623a0, {
            'contextInfo': {
                'forwardingScore': 0x7e6,
                'isForwarded': !![],
                'externalAdReply': {
                    'title': _0x11e3(0xb),
                    'body': 'bienvenido',
                    'sourceUrl': global['md'],
                    'thumbnail': await (await _0x5e9b9e(_0x371334))['buffer']()
                }
            }
        });
        await _0x29a920['sendMessage'](_0x3623a0['chat'], {
            'react': {
                'text': '📂',
                'key': _0x3623a0['key']
            }
        });
        let _0x845ef4 = '⦓           ⦓🏆⦔          ⦔ـ\x0a✆⏐اهــــلاً بـــك⬷' + _0x288273 + '\x0a✆⏐بــوت ت ــابـع⬷🎄𝐈𝐍𝐍𝐎𝐂𝐄𝐍𝐓\x0a✆⏐بــوت ت ــابـع⬷𝐀𝐍𝐆𝐄𝐋𝐎\x0a✆⏐ اسـم البـوت⬷ 𝐇𝐔 𝐓𝐀𝐎\x0a✆⏐ الـتـشـغـيـل⬷ ' + _0x318438 + '\x0a✆⏐الـــتــاريـــخ⬷ ' + _0x55375e + '\x0a✆⏐نقابه البوت ⬷ 𝐌𝐀𝐑𝐒\x0a✆⏐الـتـفـعـلاتـــ ⬷ .اقفل «|» .افتح\x0a⦓           ⦓🏆⦔          ⦔ـ\x0aقـائـمـة الـبـوت ⁦ᕙ⁠(⁠⇀⁠‸⁠↼⁠‶⁠)⁠ᕗ⁩\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🛰️⌜ قـسـم الـذكـاء الاصـطـيـنـعـي \x0a⦓           ⦓🏆⦔          ⦔ـ\x0a🌏❯ ⏐ .بـوت\x0a☫ ⌟للرد علي الاسئلة⌜\x0a🌏❯ ⏐ .تـحـدث\x0a☫ ⌟للرد علي الاسئله بمقطع صوتى⌜\x0a🌏❯ ⏐ .سـيـري\x0a☫ ⌟لتعليم اللغه الانجليزيه⌜\x0a🌏❯ ⏐ .ارسـم \x0a☫ ⌟لرسم صوره بالذكاء الاصطناعي⌜\x0a🌏❯ ⏐ .سمسم \x0a☫ ⌟شات عربي اصيل 🗿⌜\x0a🌏❯ ⏐ .احسب \x0a☫ ⌟للحل المعدلات الصعبه⌜ \x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🎡⌜ قـسـم الاعـضـاء\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a🍓❯ ⏐ .الـبـنـك \x0a☫ ⌟لعرض قائمة البنك⌜\x0a🍓❯ ⏐ .الـمـتـجـر \x0a☫ ⌟لعرض قائمة اصور المتجر⌜\x0a🍓❯ ⏐ .الـوجـوهـات \x0a☫ ⌟لعرض قائمة الوجوهات⌜ \x0a🍓❯ ⏐ .لـوجـو-حـب\x0a☫ ⌟لعرض قائمه الاصوات⌜ \x0a🍓❯ ⏐ .كـومـنـت \x0a☫ ⌟يعملك كومنت مشهور⌜ \x0a🍓❯ ⏐ .الـدعـم \x0a☫ ⌟يبعتلك الفروع الأساسيه⌜\x0a🍓❯ ⏐ .الـمـطـور \x0a☫ ⌟يبعتلك رقم صاحب البوت⌜\x0a🍓❯ ⏐ .بـروفـايـل \x0a☫ ⌟يبعتلك قائمة بروفايلك⌜\x0a🍓❯ ⏐ .مـيـمـز \x0a☫ ⌟يبعتلك ميمز عن الانمي⌜\x0a🍓❯ ⏐ .تـطـقـيـم \x0a☫ ⌟يبعتلك صور بنت و ولد⌜\x0a🍓❯ ⏐ .جـوده  \x0a☫ ⌟لتحسين جودة الصوره⌜\x0a🍓❯ ⏐ .الـطـقـس  \x0a☫ ⌟يجبلك طقس البلاد⌜\x0a🍓❯ ⏐ .بـاركـود  \x0a☫ ⌟يعملك النص qr code⌜\x0a🍓❯ ⏐ .زخـرفـه \x0a☫ ⌟يزخرف الكلام بالانجليزي⌜\x0a🍓❯ ⏐ .حـكـمـه \x0a☫ ⌟البوت يعطيك حـكـمـه⌜\x0a🍓❯ ⏐ .نـصـيـحـه \x0a☫ ⌟يزخرف الكلام بالانجليزي⌜\x0a🍓❯ ⏐ .تـصـليـح \x0a☫ ⌟ليظهرلك رسائل البوت⌜\x0a🍓❯ ⏐ .تـنـضـيف \x0a☫ ⌟لتنضيف اوامر البوت⌜\x0a🍓❯ ⏐ .مـعـلـومـات \x0a☫ ⌟يبعتلك كل معلومات البوت⌜\x0a🍓❯ ⏐ .الـحـالـه \x0a☫ ⌟يبعتلك وقت تشغيل البوت⌜\x0a🍓❯ ⏐ .انـضـم \x0a☫ ⌟ليتم انضمام البوت لي جروبك⌜\x0a🍓❯ ⏐ .الـسـرعـه \x0a☫ ⌟يبعتلك سرعة البوت⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🍀⌜ قـسـم الـجـروب\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a💌❯ ⏐ .انـذار\x0a☫ ⌟بيعطي للعضو انذار⌜\x0a💌❯ ⏐ .حـذف-الانـذار\x0a☫ ⌟بيحذف الانذار⌜\x0a💌❯ ⏐ .الانـذارات\x0a☫ ⌟يبعت قائمه انذاراتك⌜\x0a💌❯ ⏐ .جـروب غلق\x0a☫ ⌟يقفل شات الجروب⌜\x0a💌❯ ⏐ جـروب فتح\x0a☫ ⌟يفتح شات الجروب⌜\x0a💌❯ ⏐ .اعـدادات قفل 1\x0a☫ ⌟يقفل الشات بوقت⌜\x0a💌❯ ⏐ .اعـدادات فتح 1\x0a☫ ⌟يفتح الشات بي وقت⌜\x0a💌❯ ⏐ .تـغيـرالاسم\x0a☫ ⌟بيغير اسم الجروب⌜\x0a💌❯ ⏐ .تـغيـرالصوره\x0a☫ ⌟بيغير صوره الجروب ⌜\x0a💌❯ ⏐ .تـغيـرالوصف\x0a☫ ⌟بيغير وصف الجروب⌜\x0a💌❯ ⏐ .تـغيـرالترحيب\x0a☫ ⌟بيغير ترحيب البوت⌜\x0a💌❯ ⏐ .تـغيـرالوداع\x0a☫ ⌟بيغير وادع البوت⌜\x0a💌❯ ⏐ .قـائـمـه-الارقـام\x0a☫ ⌟بيجبلك قائمة الارقام برمز الدوله⌜\x0a💌❯ ⏐ .مـخـفـي\x0a☫ ⌟بيعمل منشن وهمي ⌜\x0a💌❯ ⏐ .تـرقـيـه\x0a☫ ⌟بيرفع عضو ادمن⌜\x0a💌❯ ⏐ .خـفـض\x0a☫ ⌟بيتزل ادمن عضو⌜\x0a💌❯ ⏐ .لـيـنـك\x0a☫ ⌟بيبعت لينك الجروب⌜\x0a💌❯ ⏐ .مـنـشـن\x0a☫ ⌟يعمل منشن جماعي⌜\x0a💌❯ ⏐ .الادمـن\x0a☫ ⌟يعمل منشن للادمن⌜\x0a💌❯ ⏐ .رسـتـر\x0a☫ ⌟يرستر رابط الجروب⌜\x0a💌❯ ⏐ .الاشـبـاح\x0a☫ ⌟يمنشن الناس الي مش بتتفاعل⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🌐⌜ قـسـم الـبـحـث\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a🧸❯ ⏐ .جـوجـل\x0a☫ ⌟يبحث في جوجل مع صوره⌜\x0a🧸❯ ⏐ .لـيـنـكـات\x0a☫ ⌟يبحثلك بي استخدام الرابط⌜\x0a🧸❯ ⏐ .بـحـث\x0a☫ ⌟يبحث في اليوتيوب⌜\x0a🧸❯ ⏐ .جـيـتـهاب\x0a☫ ⌟يبحث في جيت هاب⌜\x0a🧸❯ ⏐ .اغـانـي \x0a☫ ⌟بحث عن كلام الاغاني⌜\x0a🧸❯ ⏐.انـمـي\x0a☫ ⌟بحث عن الانمي بالانجليزي⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🎗️⌜ قـسـم الـتـنـزيـلات \x0a⦓           ⦓🏆⦔          ⦔ـ\x0a♻️❯ ⏐ .يوتيوب\x0a☫ ⌟تنزيل فيديو باستخدام رابط⌜\x0a♻️❯ ⏐ .يوتيوب2\x0a☫ ⌟تنزيل اغنيه باستخدام رابط⌜\x0a♻️❯ ⏐.تطبيق\x0a☫ ⌟لتنزيل التطبيقات من متجر ب⌜\x0a♻️❯ ⏐ .ميديافاير\x0a☫ ⌟لتنزيل الملفات من ميديافاير⌜\x0a♻️❯ ⏐ .فيسبوك\x0a☫ ⌟تنزيل فيديوهات من الفيسبوك⌜\x0a♻️❯ ⏐ .انستا\x0a☫ ⌟تنزيل فيديوهات من الانستجرام⌜\x0a♻️❯ ⏐ .تيك\x0a☫ ⌟تنزيل فيديوهات من التيك توك⌜\x0a♻️❯ ⏐ .صور-تيك\x0a☫ ⌟تنزيل صور من التيك توك⌜\x0a♻️❯ ⏐ .صوره\x0a☫ ⌟تنزيل صور من جوجل⌜\x0a♻️❯ ⏐ .صوره2\x0a☫ ⌟لتنزيل صور من فريبيك⌜\x0a♻️❯ ⏐ .بين\x0a☫ ⌟لتنزيل صور من بينترست⌜\x0a♻️❯ ⏐ .استيكر-تنزيل\x0a☫ ⌟لتنزيل استيكرات بالينك⌜\x0a♻️❯ ⏐ .اغنيه\x0a☫ ⌟تنزيل اغاني من اليوتيوب⌜\x0a♻️❯ ⏐ .فيديو\x0a☫ ⌟تنزيل فيديوهات من اليوتيوب⌜\x0a♻️❯ ⏐ .شغل\x0a☫ ⌟تنزيل اغاني من اليوتيوب⌜\x0a♻️❯ ⏐ .فيديو2\x0a☫ ⌟تنزيل فيديوهات من اليوتيوب⌜\x0a♻️❯ ⏐ .شغل2\x0a☫ ⌟تنزيل اغاني من اليوتيوب⌜\x0a♻️❯ ⏐ .فيديو3\x0a☫ ⌟تنزيل فيديوهات من اليوتيوب⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🍄⌜ قـسـم الـتـحـويـلات \x0a⦓           ⦓🏆⦔          ⦔ـ\x0a📍❯ ⏐ .لانـمـي\x0a☫ ⌟لتحويل الصوره لانمي⌜\x0a📍❯ ⏐ .جـيـف\x0a☫ ⌟لتحويل الفيديو لgif⌜\x0a📍❯ ⏐ .لـصـوره\x0a☫ ⌟لتحويل الملصق لصوره⌜\x0a📍❯ ⏐ .لـصـوت\x0a☫ ⌟لتحويل الفيديو لصوت⌜\x0a📍❯ ⏐ .لـريـك\x0a☫ ⌟لتحويل الفيديو لريكورد⌜\x0a📍❯ ⏐ .لـفـيـديـو\x0a☫ ⌟لتحويل الملصق لفيديو⌜\x0a📍❯ ⏐ .تـلـيـجـراف\x0a☫ ⌟لتحويل الاشياء الي تليجراف⌜\x0a📍❯ ⏐ .انـطـق\x0a☫ ⌟لتحويل النص الي صوت⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🎯⌜ قـسـم الالـعـاب \x0a⦓           ⦓🏆⦔          ⦔ـ\x0a🕹️❯ ⏐ .العب\x0a☫ ⌟تلعب حجر ورقه مع البوت⌜\x0a🕹️❯ ⏐ .عين\x0a☫ ⌟احزر الشخصية من العين⌜\x0a🕹️❯ ⏐ .علم\x0a☫ ⌟احزر الدوله من العلم⌜\x0a🕹️❯ ⏐ .احزر\x0a☫ ⌟احزر الشخصية من الصوره⌜\x0a🕹️❯ ⏐ .ايمواجي \x0a☫ ⌟يبعتلك ايمواجي عشوائي⌜\x0a🕹️❯ ⏐ .تحدي\x0a☫ ⌟حجر ورقه مقص مع صاحبك⌜\x0a🕹️❯ ⏐ .حظ\x0a☫ ⌟لعبة الحظ مع البوت⌜\x0a🕹️❯ ⏐ .اكس\x0a☫ ⌟لعبة اكس او مع صديقك⌜\x0a🕹️❯ ⏐ .سؤال\x0a☫ ⌟سؤال من عالم انمي⌜\x0a🕹️❯ ⏐ .توب\x0a☫ ⌟يعمل منشن ل 10 أعضاء⌜\x0a🕹️❯ ⏐ .زواج\x0a☫ ⌟يجوز اتنين في الجروب 🤣⌜\x0a🕹️❯ ⏐ .هل \x0a☫ ⌟تسال البوت و هوا يجاوب⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🔊⌜ قـسـم الاصـوات \x0a⦓           ⦓🏆⦔          ⦔ـ\x0a🎙️❯ ⏐ .عـمـيـق \x0a☫ ⌟يخلي الريك عميق ⌜\x0a🎙️❯ ⏐ .مـنـفـوخ \x0a☫ ⌟يخلي الصوت منفوخ ⌜\x0a🎙️❯ ⏐ .تخين \x0a☫ ⌟يخلي الصوت تخين ⌜\x0a🎙️❯ ⏐ .صـاخـب \x0a☫ ⌟يخلي الصوت صاحب ⌜\x0a🎙️❯ ⏐ .تخينن\x0a☫ ⌟يخلي الصوت تخين جداً⌜\x0a🎙️❯ ⏐ .سـريـع \x0a☫ ⌟يخلي الصوت سريع ⌜\x0a🎙️❯ ⏐ .رفـيـع \x0a☫ ⌟يخلي الصوت رفيع ⌜\x0a🎙️❯ ⏐ .روبـوت \x0a☫ ⌟يخلي الصوت روبوت ⌜\x0a🎙️❯ ⏐ .نـاعـم \x0a☫ ⌟يخلي الصوت ناعم ⌜\x0a🎙️❯ ⏐ .سـنـجـاب \x0a☫ ⌟يخلي الصوت مسنجب ⌜\x0aلسه بعدل ف بجرب حاجه الي هيضحك هيموتتتتتت ⛄\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🖼️⌜ قـسـم الـصـور \x0a⦓           ⦓🏆⦔          ⦔ـ\x0a🌱❯ ⏐ .كـانـيـكـي \x0a☫ ⌟يبعت صور كانيكي⌜\x0a🌱❯ ⏐ . مـادارا \x0a☫ ⌟يبعت صور مادارا⌜\x0a🌱❯ ⏐ .مـيـنـاتـو \x0a☫ ⌟يبعت صور ميناتو⌜\x0a🌱❯ ⏐ .مـيـكاسـا \x0a☫ ⌟يبعت صور ميكاسا⌜\x0a🌱❯ ⏐ . مـراتي\x0a☫ ⌟يبعت صور مراتك⌜\x0a🌱❯ ⏐ .قـط \x0a☫ ⌟يبعت صور قطط⌜\x0a🌱❯ ⏐ .كـلـب\x0a☫ ⌟يبعت صور كلاب⌜\x0a🌱❯ ⏐ .جيمينج \x0a☫ ⌟يبعت صور جيمينج⌜\x0a🌱❯ ⏐ .رونـالـدو \x0a☫ ⌟يبعت صور رونالدو⌜\x0a🌱❯ ⏐ .مـيـسـي \x0a☫ ⌟يبعت صور ميسي⌜\x0a🌱❯ ⏐ .تكنولوجيا \x0a☫ ⌟يبعت صور تكنولوجيا⌜\x0a🌱❯ ⏐ .عـشـوائـي \x0a☫ ⌟يبعت صور عشوائيه⌜\x0a🌱❯ ⏐ .عـيـد \x0a☫ ⌟يبعت صور عيد صاحبي🗿⌜\x0a🌱❯ ⏐ .جـبـل \x0a☫ ⌟يبعت صور جبال⌜\x0a🌱❯ ⏐ .بـبـجـي \x0a☫ ⌟يبعت صور ببجي⌜\x0a🌱❯ ⏐ .بلاك-بينك \x0a☫ ⌟يبعت صور بلاك بينك⌜\x0a🌱❯ ⏐ .درايمون \x0a☫ ⌟يبعت صور معرفش⌜\x0a🌱❯ ⏐ .هـكـر \x0a☫ ⌟يبعت صوري عشان انا هكر🗿⌜\x0a🌱❯ ⏐ .كـوكـب \x0a☫ ⌟يبعت صور كواكب⌜\x0a🌱❯ ⏐ . كـرتـون \x0a☫ ⌟يبعت صور كرتون⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🖼️⌜ قـسـم الاستيكرات\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a🧨❯ ⏐ .اسـتـيـكر\x0a☫ ⌟لتحول الصوره لملصق كامل⌜\x0a🧨❯ ⏐ .مـلـصـق\x0a☫ ⌟لتحويل الفيديو لملصق متحرك⌜\x0a🧨❯ ⏐.دائري\x0a☫ ⌟لعمل استيكرات بشكل دائري⌜\x0a🧨❯ ⏐ .سـرقـه\x0a☫ ⌟يغير حقوق الملصقات⌜\x0a🧨❯ ⏐ .فـلـتـر\x0a☫ ⌟يعمل فلتر للملصقات⌜\x0a🧨❯ ⏐ .تـاثـيـر\x0a☫ ⌟يعمل فلتر للملصقات⌜\x0a🧨❯ ⏐ .صـفـع\x0a☫ ⌟لصفع الناس الرخمه 😡❤️⌜\x0a🧨❯ ⏐ .طـبـطـبـه\x0a☫ ⌟لطبطبه علي الناس الكيوت👾⌜\x0a🧨❯ ⏐ .اسـتـيك\x0a☫ ⌟يحول النص لملصق ⌜\x0a🧨❯ ⏐ .ستاكت\x0a☫ ⌟يحول النص لملصق⌜\x0a🧨❯ ⏐ .دمـج ☺+😈\x0a☫ ⌟يدمج اتنين من الايمواجي⌜\x0a🧨❯ ⏐ .نــرد\x0a☫ ⌟جرب حظك كده 😀⌜\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a⌟🖼️⌜ قـسـم الـمـطـور\x0a⦓           ⦓🏆⦔          ⦔ـ\x0a👑❯ ⏐ .حظر\x0a☫ ⌟يعمل حظر شات⌜\x0a👑❯ ⏐ .فك-الحظر\x0a☫ ⌟يفك حظر الشات⌜\x0a👑❯ ⏐ .المحظورين\x0a☫ ⌟يبعتلك الناس المحظوره⌜\x0a👑❯ ⏐.بلوك\x0a☫ ⌟يعمل بلوك سريع⌜\x0a👑❯ ⏐ .فك-البلوك\x0a☫ ⌟يفك البلوك⌜\x0a👑❯ ⏐ .البلوكات\x0a☫ ⌟يبعتلك قائمة البلوكات⌜\x0a👑❯ ⏐ .بريم\x0a☫ ⌟يخلي مميز في البوت⌜\x0a👑❯ ⏐ .الغاء-البريم\x0a☫ ⌟يشيل البريم⌜\x0a👑❯ ⏐ .بان\x0a☫ ⌟ينعهم من استخدام البوت⌜\x0a👑❯ ⏐ .فك-البان\x0a☫ ⌟يفك البان من البوت⌜\x0a│⚝ ⃟👑❯.ريستارت\x0a☫ ⌟يقفل البوت من ريبلايت⌜\x0a👑❯ ⏐ .ضع-صوره\x0a☫ ⌟يخلي البوت يحط صوره⌜\x0a👑❯ ⏐ .ضيف-عملات\x0a☫ ⌟يضيف للمستخدمين عملات⌜\x0a👑❯ ⏐ .ضيف-طاقه\x0a☫ ⌟يضيف للمستخدمين طاقه⌜\x0a👑❯ ⏐ .موارد\x0a☫ ⌟يعطي موارد غير محدوده⌜\x0a👑❯ ⏐ .اخرج\x0a☫ ⌟يطلع البوت من الجروب⌜\x0a👑❯ ⏐ .اذاعه\x0a☫ ⌟يبعت رساله لجميع الجروبات⌜\x0a👑❯ ⏐ فتح | قفل صوت_بوت\x0a☫ ⌟يقفل و يفتح صوت البوت⌜\x0a👑❯ ⏐ .فتح | قفل مضادالاسبام\x0a☫ ⌟يقفل و يفتح الاسبام⌜\x0a👑❯ ⏐ .فتح | قفل بوت-اللفرعي\x0a☫ ⌟يقفل و يفتح البوتات الفرعي⌜\x0a👑❯ ⏐ .فتح | قفل مضادالخاص\x0a☫ ⌟يقفل و يفتح خاص البوت⌜\x0a👑❯ ⏐ .فتح | قفل مضادالاتصالات\x0a☫ ⌟يقفل و يفتح الاتصالات ب البوت⌜\x0a👑❯ ⏐ .فتح | قفل جروبات\x0a☫ ⌟يقفل و يفتح الجروبات فقط⌜\x0a👑❯ ⏐ .فتح | قفل برايفت\x0a☫ ⌟يقفل و يفتح البرايفت⌜\x0a👑❯ ⏐ .فتح | قفل الصحين\x0a☫ ⌟يقفل و يفتح أمر الصحين⌜\x0a👑❯ ⏐فتح | قفل تقيد\x0a☫ ⌟يقفل و يفتح تقيد البوت⌜\x0a⦓           ⦓🏆⦔          ⦔\x0a✒️⏐نقابتي\x0a https://chat.whatsapp.com/HzfsFIfYTj7HdjbekZPfIT\x0a\x0a✒️⏐رقمي \x0ahttps://wa.me/+201128698632\x0a\x0a ادخل نقابه البوت لو عايز البوت في نقابتك ☺️💗\x0a⦓           ⦓🏆⦔          ⦔';
        await _0x29a920['sendMessage'](_0x3623a0['chat'], {
            'text': _0x845ef4['trim'](),
            'mentions': [..._0x845ef4['matchAll'](/@([0-9]{5,16}|0)/g)]['map'](_0x42f4ba => _0x42f4ba[0x1] + '@s.whatsapp.net'),
            'contextInfo': {
                'forwardingScore': 0x98967f,
                'isForwarded': !![],
                'mentionedJid': [..._0x845ef4['matchAll'](/@([0-9]{5,16}|0)/g)]['map'](_0x2a3c00 => _0x2a3c00[0x1] + '@s.whatsapp.net'),
                'externalAdReply': {
                    'showAdAttribution': !![],
                    'containsAutoReply': !![],
                    'renderLargerThumbnail': !![],
                    'title': '乂🏆𝐈𝐍𝐍𝐎𝐂𝐄𝐍𝐓🧿𝐀𝐍𝐆𝐄𝐋𝐎🏆乂',
                    'containsAutoReply': !![],
                    'mediaType': 0x1,
                    'thumbnail': [imagen6, imagen1, imagen4]['getRandom'](),
                    'mediaUrl': global['gp1'],
                    'sourceUrl': global['gp1']
                }
            }
        }, {
            'quoted': _0x180040
        });
    } catch {
        _0x29a920['reply'](_0x3623a0['chat'], '*❗ حـدث خـطـاء*', _0x3623a0);
    }
};

function _0x11e3(_0x4ac36f, _0x3e6922) {
    const _0x11e349 = _0x3e69();
    _0x11e3 = function (_0x46af3d, _0x3599a5) {
        _0x46af3d = _0x46af3d - 0x0;
        let _0x57c924 = _0x11e349[_0x46af3d];
        return _0x57c924;
    };
    return _0x11e3(_0x4ac36f, _0x3e6922);
}
handler['help'] = ['menu'];
handler['tags'] = ['menu'];
handler[_0x11e3(0x2)] = /^(مهام|المهام)$/i;

function _0x3e69() {
    const _0x5d0622 = [',\x0aitem1.TEL;waid=', '27884guoogK', '115PpfyUw', '464434mNpPGU', 'command', 'join', '19072130bcEEIf', 'data', '376BAnCJa', '0@s.whatsapp.net', 'toLocaleDateString', '3418821qYruAz', '7758990gnrJCj', 'متنساش تدخل نقابه البوت يحب😡❤️', '2EaRpnY', '3034737NxTGZA', '141477Ldwdrm'];
    _0x3e69 = function () {
        return _0x5d0622;
    };
    return _0x3e69();
}
export default handler;

function clockString(_0x3335d2) {
    const _0x33782b = isNaN(_0x3335d2) ? '--' : Math['floor'](_0x3335d2 / 0x36ee80);
    const _0x3e6691 = isNaN(_0x3335d2) ? '--' : Math['floor'](_0x3335d2 / 0xea60) % 0x3c;
    const _0x3d8ab6 = isNaN(_0x3335d2) ? '--' : Math['floor'](_0x3335d2 / 0x3e8) % 0x3c;
    return [_0x33782b, _0x3e6691, _0x3d8ab6]['map'](_0x432d4c => _0x432d4c['toString']()['padStart'](0x2, 0x0))[_0x11e3(0x3)](':');
}